# Створіть масив зі строками, які будуть складатися з чисел, які розділені комою. Наприклад:
#
# [”1,2,3,4”, ”1,2,3,4,50” ”qwerty1,2,3”]
#
# Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).
#
# Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і вивести “Не можу це зробити!”
#
# Використовуйте блок try\except, щоб уникнути інших символів, окрім чисел у списку.
#
# Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити”



strings = ["1,2,3,4", "1,2,3,4,50", "qwerty1,2,3"]

def total_sum_of_numbers(s: str):
    parts = s.split(",")
    total = 0
    for part in parts:
        total += int(part)
    return total

for i in strings:
    try:
        res = total_sum_of_numbers(i)
        print(res)
    except:
        print("Не можу це зробити!")