# Порахувати кількість унікальних символів в строці.
# Якщо їх більше 10 - вивести в консоль True, інакше - False. Строку отримати за допомогою функції input()
# Перевірте, що репозиторій в git є публічним або ваш вчитель доданий до цього репозиторію.
# Ви можете перевірити це в інкогніто-режимі вашого браузера.
# Просто вставте посилання на свій репозиторій та переконайтеся, що ви можете побачити код.

inp_str = input("Введіть будь-яке символьне значення: ")

str_cnt = set(inp_str)
print(len(str_cnt))

if len(str_cnt) > 10:
    print(True)
else:
    print(False)
